Repository: Richasy/LoopbackManager.Desktop
Catalog: src/LoopbackManager.Shell/Strings/*/Resources.resw
Source language: en_us
Languages: zh_cn, zh_hant

# AppName
source: Loopback Manager
zh_cn: 网络回环管理器
zh_hant: 網路回環管理器

# AppDescription
source: Manage local network loopback exemptions for apps.
zh_cn: 管理应用的本地网络回环豁免。
zh_hant: 管理應用程式的本機網路回環豁免。

# LoadFailed
source: Failed to load apps
zh_cn: 加载失败
zh_hant: 載入應用程式失敗

# LoadErrorAccessDeniedHelp
source: Windows denied access to the network-isolation configuration. Use an administrator account and check whether security software or organizational policy is blocking the Windows Firewall API, then retry.
zh_cn: 系统拒绝访问网络隔离配置。请使用管理员账户，并检查安全软件或组织策略是否阻止 Windows 防火墙 API，然后重试。
zh_hant: 系統拒絕存取網路隔離設定。請使用系統管理員帳戶，並檢查安全性軟體或組織原則是否封鎖 Windows 防火牆 API，然後重試。

# LoadErrorDetails
source: Error details
zh_cn: 错误详情
zh_hant: 錯誤詳細資料

# LoadErrorFirewallServiceHelp
source: The Windows Firewall service is unavailable. In Services, make sure Base Filtering Engine and Windows Defender Firewall are running. If security software or organizational policy disabled them, restore those settings and retry.
zh_cn: Windows 防火墙服务不可用。请在“服务”中确认“Base Filtering Engine”和“Windows Defender 防火墙”已启动；若被安全软件或组织策略禁用，请先恢复相关设置再重试。
zh_hant: Windows 防火牆服務無法使用。請在「服務」中確認「Base Filtering Engine」與「Windows Defender 防火牆」已啟動；若遭安全性軟體或組織原則停用，請先還原相關設定再重試。

# LoadErrorInvalidConfigurationHelp
source: Windows returned invalid AppContainer or SID configuration data. Restart Windows and install system updates. If it still fails, repair Windows components with DISM and SFC.
zh_cn: Windows 返回了无效的 AppContainer 或 SID 配置。请重启 Windows 并安装系统更新；若仍失败，请使用 DISM 和 SFC 修复系统组件。
zh_hant: Windows 傳回了無效的 AppContainer 或 SID 設定。請重新啟動 Windows 並安裝系統更新；若仍失敗，請使用 DISM 與 SFC 修復系統元件。

# LoadErrorMissingComponentHelp
source: A required Windows network-isolation component is missing or incompatible. Install system updates, then run “DISM /Online /Cleanup-Image /RestoreHealth” and “sfc /scannow” as administrator and restart Windows.
zh_cn: 所需的 Windows 网络隔离组件缺失或不兼容。请安装系统更新，然后以管理员身份运行“DISM /Online /Cleanup-Image /RestoreHealth”和“sfc /scannow”，完成后重启 Windows。
zh_hant: 所需的 Windows 網路隔離元件遺失或不相容。請安裝系統更新，然後以系統管理員身分執行「DISM /Online /Cleanup-Image /RestoreHealth」與「sfc /scannow」，完成後重新啟動 Windows。

# LoadErrorResourceExhaustedHelp
source: Windows did not have enough memory to read the app list. Close some apps or restart Windows, then retry.
zh_cn: Windows 没有足够的内存读取应用列表。请关闭部分应用或重启 Windows，然后重试。
zh_hant: Windows 沒有足夠的記憶體讀取應用程式清單。請關閉部分應用程式或重新啟動 Windows，然後重試。

# LoadErrorUnknownHelp
source: Retry first. If it still fails, restart Windows and make sure Base Filtering Engine and Windows Defender Firewall are running. Include the error details below when reporting the problem.
zh_cn: 请先重试；若仍失败，请重启 Windows，并确认“Base Filtering Engine”和“Windows Defender 防火墙”服务正常。反馈问题时请附上下方错误详情。
zh_hant: 請先重試；若仍失敗，請重新啟動 Windows，並確認「Base Filtering Engine」與「Windows Defender 防火牆」服務正常。回報問題時請附上下方錯誤詳細資料。

# LoadErrorUnsupportedSystemHelp
source: This Windows environment does not support the network-isolation API. Install system updates; on a customized or stripped-down Windows installation, restore the Windows Firewall components.
zh_cn: 当前 Windows 环境不支持网络隔离接口。请安装系统更新；若使用精简版系统，请恢复 Windows 防火墙组件。
zh_hant: 目前的 Windows 環境不支援網路隔離介面。請安裝系統更新；若使用精簡版系統，請還原 Windows 防火牆元件。

source: Loading…
zh_cn: 正在加载…
zh_hant: 正在載入…

# NoApps
source: No apps found
zh_cn: 没有找到任何应用
zh_hant: 找不到任何應用程式

# NoSearchResults
source: No matching apps
zh_cn: 没有匹配的应用
zh_hant: 找不到符合的應用程式

# OpenWorkDirectory
source: Open working directory
zh_cn: 打开工作目录
zh_hant: 打開工作目錄

# PartialLoadFallbackMessage
source: Windows couldn't enumerate AppContainers as a batch, so compatible per-package enumeration is being used. All readable apps are shown.
zh_cn: Windows 无法批量枚举 AppContainer，已切换到逐包兼容模式；当前已显示所有可读取的应用。

# PartialLoadFallbackSkippedMessage
source: Windows couldn't enumerate AppContainers as a batch, so compatible per-package enumeration is being used. {0} unreadable package(s) were skipped.
zh_cn: Windows 无法批量枚举 AppContainer，已切换到逐包兼容模式，并跳过了 {0} 个无法读取的包。

# PartialLoadSkippedMessage
source: {0} app entry or entries returned invalid metadata and were skipped. All other apps are shown.
zh_cn: 有 {0} 个应用条目的信息无效，已将其跳过；其余应用仍正常显示。

# PartialLoadTitle
source: Some apps couldn't be loaded
zh_cn: 部分应用未能加载

source: Refresh
zh_cn: 刷新
zh_hant: 重新整理

source: Reset
zh_cn: 重置
zh_hant: 重設

source: Retry
zh_cn: 重试
zh_hant: 重試

source: Save
zh_cn: 保存
zh_hant: 儲存

source: Saved
zh_cn: 已保存
zh_hant: 已儲存

# SaveFailedMessage
source: Your changes couldn't be saved. Please try again.
zh_cn: 无法保存你的更改，请重试。
zh_hant: 無法儲存您的變更，請再試一次。

# SaveFailedTitle
source: Couldn't save changes
zh_cn: 无法保存更改
zh_hant: 無法儲存變更

source: Saving…
zh_cn: 正在保存…
zh_hant: 正在儲存…

# SearchPlaceholder
source: Search apps
zh_cn: 搜索应用名称
zh_hant: 搜尋應用程式

source: Select all
zh_cn: 全选
zh_hant: 全選
